SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/BGM22/Include/bgm22_agc.h
/* Bit fields for AGC GAINRANGE */
#define _AGC_GAINRANGE_RESETVALUE                   0x08813187UL                                 /**< Default value for AGC_GAINRANGE             */
#define _AGC_GAINRANGE_MASK                         0x0FFFFFFFUL                                 /**< Mask for AGC_GAINRANGE                      */
#define _AGC_GAINRANGE_LNAINDEXBORDER_SHIFT         0                                            /**< Shift value for AGC_LNAINDEXBORDER          */
#define _AGC_GAINRANGE_LNAINDEXBORDER_MASK          0xFUL                                        /**< Bit mask for AGC_LNAINDEXBORDER             */
#define _AGC_GAINRANGE_LNAINDEXBORDER_DEFAULT       0x00000007UL                                 /**< Mode DEFAULT for AGC_GAINRANGE              */
#define AGC_GAINRANGE_LNAINDEXBORDER_DEFAULT        (_AGC_GAINRANGE_LNAINDEXBORDER_DEFAULT << 0) /**< Shifted mode DEFAULT for AGC_GAINRANGE      */
#define _AGC_GAINRANGE_PGAINDEXBORDER_SHIFT         4                                            /**< Shift value for AGC_PGAINDEXBORDER          */
#define _AGC_GAINRANGE_PGAINDEXBORDER_MASK          0xF0UL                                       /**< Bit mask for AGC_PGAINDEXBORDER             */
#define _AGC_GAINRANGE_PGAINDEXBORDER_DEFAULT       0x00000008UL                                 /**< Mode DEFAULT for AGC_GAINRANGE              */
#define AGC_GAINRANGE_PGAINDEXBORDER_DEFAULT        (_AGC_GAINRANGE_PGAINDEXBORDER_DEFAULT << 4) /**< Shifted mode DEFAULT for AGC_GAINRANGE      */
#define _AGC_GAINRANGE_GAININCSTEP_SHIFT            8                                            /**< Shift value for AGC_GAININCSTEP             */
#define _AGC_GAINRANGE_GAININCSTEP_MASK             0xF00UL                                      /**< Bit mask for AGC_GAININCSTEP                */
#define _AGC_GAINRANGE_GAININCSTEP_DEFAULT          0x00000001UL                                 /**< Mode DEFAULT for AGC_GAINRANGE              */
#define AGC_GAINRANGE_GAININCSTEP_DEFAULT           (_AGC_GAINRANGE_GAININCSTEP_DEFAULT << 8)    /**< Shifted mode DEFAULT for AGC_GAINRANGE      */
#define _AGC_GAINRANGE_PNGAINSTEP_SHIFT             12                                           /**< Shift value for AGC_PNGAINSTEP              */
#define _AGC_GAINRANGE_PNGAINSTEP_MASK              0xF000UL                                     /**< Bit mask for AGC_PNGAINSTEP                 */
#define _AGC_GAINRANGE_PNGAINSTEP_DEFAULT           0x00000003UL                                 /**< Mode DEFAULT for AGC_GAINRANGE              */
#define AGC_GAINRANGE_PNGAINSTEP_DEFAULT            (_AGC_GAINRANGE_PNGAINSTEP_DEFAULT << 12)    /**< Shifted mode DEFAULT for AGC_GAINRANGE      */
#define _AGC_GAINRANGE_LATCHEDHISTEP_SHIFT          16                                           /**< Shift value for AGC_LATCHEDHISTEP           */
#define _AGC_GAINRANGE_LATCHEDHISTEP_MASK           0xF0000UL                                    /**< Bit mask for AGC_LATCHEDHISTEP              */
#define _AGC_GAINRANGE_LATCHEDHISTEP_DEFAULT        0x00000001UL                                 /**< Mode DEFAULT for AGC_GAINRANGE              */
#define AGC_GAINRANGE_LATCHEDHISTEP_DEFAULT         (_AGC_GAINRANGE_LATCHEDHISTEP_DEFAULT << 16) /**< Shifted mode DEFAULT for AGC_GAINRANGE      */
#define _AGC_GAINRANGE_HIPWRTHD_SHIFT               20                                           /**< Shift value for AGC_HIPWRTHD                */
#define _AGC_GAINRANGE_HIPWRTHD_MASK                0x3F00000UL                                  /**< Bit mask for AGC_HIPWRTHD                   */
#define _AGC_GAINRANGE_HIPWRTHD_DEFAULT             0x00000008UL                                 /**< Mode DEFAULT for AGC_GAINRANGE              */
#define AGC_GAINRANGE_HIPWRTHD_DEFAULT              (_AGC_GAINRANGE_HIPWRTHD_DEFAULT << 20)      /**< Shifted mode DEFAULT for AGC_GAINRANGE      */
#define AGC_GAINRANGE_BOOSTLNA                      (0x1UL << 26)                                /**< LNA GAIN BOOST mode                         */
#define _AGC_GAINRANGE_BOOSTLNA_SHIFT               26                                           /**< Shift value for AGC_BOOSTLNA                */
#define _AGC_GAINRANGE_BOOSTLNA_MASK                0x4000000UL                                  /**< Bit mask for AGC_BOOSTLNA                   */
#define _AGC_GAINRANGE_BOOSTLNA_DEFAULT             0x00000000UL                                 /**< Mode DEFAULT for AGC_GAINRANGE              */
#define AGC_GAINRANGE_BOOSTLNA_DEFAULT              (_AGC_GAINRANGE_BOOSTLNA_DEFAULT << 26)      /**< Shifted mode DEFAULT for AGC_GAINRANGE      */
#define AGC_GAINRANGE_LNABWADJ                      (0x1UL << 27)                                /**< LNA BW ADJUST                               */
#define _AGC_GAINRANGE_LNABWADJ_SHIFT               27                                           /**< Shift value for AGC_LNABWADJ                */
#define _AGC_GAINRANGE_LNABWADJ_MASK                0x8000000UL                                  /**< Bit mask for AGC_LNABWADJ                   */
#define _AGC_GAINRANGE_LNABWADJ_DEFAULT             0x00000001UL                                 /**< Mode DEFAULT for AGC_GAINRANGE              */
#define AGC_GAINRANGE_LNABWADJ_DEFAULT              (_AGC_GAINRANGE_LNABWADJ_DEFAULT << 27)      /**< Shifted mode DEFAULT for AGC_GAINRANGE      */

/* Bit fields for AGC AGCPERIOD */
#define _AGC_AGCPERIOD_RESETVALUE                   0xD607370EUL                                /**< Default value for AGC_AGCPERIOD             */
#define _AGC_AGCPERIOD_MASK                         0xFFFFFFFFUL                                /**< Mask for AGC_AGCPERIOD                      */
#define _AGC_AGCPERIOD_PERIODHI_SHIFT               0                                           /**< Shift value for AGC_PERIODHI                */
#define _AGC_AGCPERIOD_PERIODHI_MASK                0xFFUL                                      /**< Bit mask for AGC_PERIODHI                   */
#define _AGC_AGCPERIOD_PERIODHI_DEFAULT             0x0000000EUL                                /**< Mode DEFAULT for AGC_AGCPERIOD              */
#define AGC_AGCPERIOD_PERIODHI_DEFAULT              (_AGC_AGCPERIOD_PERIODHI_DEFAULT << 0)      /**< Shifted mode DEFAULT for AGC_AGCPERIOD      */
#define _AGC_AGCPERIOD_PERIODLO_SHIFT               8                                           /**< Shift value for AGC_PERIODLO                */
#define _AGC_AGCPERIOD_PERIODLO_MASK                0xFF00UL                                    /**< Bit mask for AGC_PERIODLO                   */
#define _AGC_AGCPERIOD_PERIODLO_DEFAULT             0x00000037UL                                /**< Mode DEFAULT for AGC_AGCPERIOD              */
#define AGC_AGCPERIOD_PERIODLO_DEFAULT              (_AGC_AGCPERIOD_PERIODLO_DEFAULT << 8)      /**< Shifted mode DEFAULT for AGC_AGCPERIOD      */
#define _AGC_AGCPERIOD_MAXHICNTTHD_SHIFT            16                                          /**< Shift value for AGC_MAXHICNTTHD             */
#define _AGC_AGCPERIOD_MAXHICNTTHD_MASK             0xFF0000UL                                  /**< Bit mask for AGC_MAXHICNTTHD                */
#define _AGC_AGCPERIOD_MAXHICNTTHD_DEFAULT          0x00000007UL                                /**< Mode DEFAULT for AGC_AGCPERIOD              */
#define AGC_AGCPERIOD_MAXHICNTTHD_DEFAULT           (_AGC_AGCPERIOD_MAXHICNTTHD_DEFAULT << 16)  /**< Shifted mode DEFAULT for AGC_AGCPERIOD      */
#define _AGC_AGCPERIOD_SETTLETIMEIF_SHIFT           24                                          /**< Shift value for AGC_SETTLETIMEIF            */
#define _AGC_AGCPERIOD_SETTLETIMEIF_MASK            0xF000000UL                                 /**< Bit mask for AGC_SETTLETIMEIF               */
#define _AGC_AGCPERIOD_SETTLETIMEIF_DEFAULT         0x00000006UL                                /**< Mode DEFAULT for AGC_AGCPERIOD              */
#define AGC_AGCPERIOD_SETTLETIMEIF_DEFAULT          (_AGC_AGCPERIOD_SETTLETIMEIF_DEFAULT << 24) /**< Shifted mode DEFAULT for AGC_AGCPERIOD      */
#define _AGC_AGCPERIOD_SETTLETIMERF_SHIFT           28                                          /**< Shift value for AGC_SETTLETIMERF            */
#define _AGC_AGCPERIOD_SETTLETIMERF_MASK            0xF0000000UL                                /**< Bit mask for AGC_SETTLETIMERF               */
#define _AGC_AGCPERIOD_SETTLETIMERF_DEFAULT         0x0000000DUL                                /**< Mode DEFAULT for AGC_AGCPERIOD              */
#define AGC_AGCPERIOD_SETTLETIMERF_DEFAULT          (_AGC_AGCPERIOD_SETTLETIMERF_DEFAULT << 28) /**< Shifted mode DEFAULT for AGC_AGCPERIOD      */

/* Bit fields for AGC HICNTREGION */
#define _AGC_HICNTREGION_RESETVALUE                 0x08060543UL                                  /**< Default value for AGC_HICNTREGION           */
#define _AGC_HICNTREGION_MASK                       0xFFFFFFFFUL                                  /**< Mask for AGC_HICNTREGION                    */
#define _AGC_HICNTREGION_HICNTREGION0_SHIFT         0                                             /**< Shift value for AGC_HICNTREGION0            */
#define _AGC_HICNTREGION_HICNTREGION0_MASK          0xFUL                                         /**< Bit mask for AGC_HICNTREGION0               */
#define _AGC_HICNTREGION_HICNTREGION0_DEFAULT       0x00000003UL                                  /**< Mode DEFAULT for AGC_HICNTREGION            */
#define AGC_HICNTREGION_HICNTREGION0_DEFAULT        (_AGC_HICNTREGION_HICNTREGION0_DEFAULT << 0)  /**< Shifted mode DEFAULT for AGC_HICNTREGION    */
#define _AGC_HICNTREGION_HICNTREGION1_SHIFT         4                                             /**< Shift value for AGC_HICNTREGION1            */
#define _AGC_HICNTREGION_HICNTREGION1_MASK          0xF0UL                                        /**< Bit mask for AGC_HICNTREGION1               */
#define _AGC_HICNTREGION_HICNTREGION1_DEFAULT       0x00000004UL                                  /**< Mode DEFAULT for AGC_HICNTREGION            */
#define AGC_HICNTREGION_HICNTREGION1_DEFAULT        (_AGC_HICNTREGION_HICNTREGION1_DEFAULT << 4)  /**< Shifted mode DEFAULT for AGC_HICNTREGION    */
#define _AGC_HICNTREGION_HICNTREGION2_SHIFT         8                                             /**< Shift value for AGC_HICNTREGION2            */
#define _AGC_HICNTREGION_HICNTREGION2_MASK          0xFF00UL                                      /**< Bit mask for AGC_HICNTREGION2               */
#define _AGC_HICNTREGION_HICNTREGION2_DEFAULT       0x00000005UL                                  /**< Mode DEFAULT for AGC_HICNTREGION            */
#define AGC_HICNTREGION_HICNTREGION2_DEFAULT        (_AGC_HICNTREGION_HICNTREGION2_DEFAULT << 8)  /**< Shifted mode DEFAULT for AGC_HICNTREGION    */
#define _AGC_HICNTREGION_HICNTREGION3_SHIFT         16                                            /**< Shift value for AGC_HICNTREGION3            */
#define _AGC_HICNTREGION_HICNTREGION3_MASK          0xFF0000UL                                    /**< Bit mask for AGC_HICNTREGION3               */
#define _AGC_HICNTREGION_HICNTREGION3_DEFAULT       0x00000006UL                                  /**< Mode DEFAULT for AGC_HICNTREGION            */
#define AGC_HICNTREGION_HICNTREGION3_DEFAULT        (_AGC_HICNTREGION_HICNTREGION3_DEFAULT << 16) /**< Shifted mode DEFAULT for AGC_HICNTREGION    */
#define _AGC_HICNTREGION_HICNTREGION4_SHIFT         24                                            /**< Shift value for AGC_HICNTREGION4            */
#define _AGC_HICNTREGION_HICNTREGION4_MASK          0xFF000000UL                                  /**< Bit mask for AGC_HICNTREGION4               */
#define _AGC_HICNTREGION_HICNTREGION4_DEFAULT       0x00000008UL                                  /**< Mode DEFAULT for AGC_HICNTREGION            */
#define AGC_HICNTREGION_HICNTREGION4_DEFAULT        (_AGC_HICNTREGION_HICNTREGION4_DEFAULT << 24) /**< Shifted mode DEFAULT for AGC_HICNTREGION    */

/* Bit fields for AGC STEPDWN */
#define _AGC_STEPDWN_RESETVALUE                     0x00036D11UL                          /**< Default value for AGC_STEPDWN               */
#define _AGC_STEPDWN_MASK                           0x0003FFFFUL                          /**< Mask for AGC_STEPDWN                        */
#define _AGC_STEPDWN_STEPDWN0_SHIFT                 0                                     /**< Shift value for AGC_STEPDWN0                */
#define _AGC_STEPDWN_STEPDWN0_MASK                  0x7UL                                 /**< Bit mask for AGC_STEPDWN0                   */
#define _AGC_STEPDWN_STEPDWN0_DEFAULT               0x00000001UL                          /**< Mode DEFAULT for AGC_STEPDWN                */
#define AGC_STEPDWN_STEPDWN0_DEFAULT                (_AGC_STEPDWN_STEPDWN0_DEFAULT << 0)  /**< Shifted mode DEFAULT for AGC_STEPDWN        */
#define _AGC_STEPDWN_STEPDWN1_SHIFT                 3                                     /**< Shift value for AGC_STEPDWN1                */
#define _AGC_STEPDWN_STEPDWN1_MASK                  0x38UL                                /**< Bit mask for AGC_STEPDWN1                   */
#define _AGC_STEPDWN_STEPDWN1_DEFAULT               0x00000002UL                          /**< Mode DEFAULT for AGC_STEPDWN                */
#define AGC_STEPDWN_STEPDWN1_DEFAULT                (_AGC_STEPDWN_STEPDWN1_DEFAULT << 3)  /**< Shifted mode DEFAULT for AGC_STEPDWN        */
#define _AGC_STEPDWN_STEPDWN2_SHIFT                 6                                     /**< Shift value for AGC_STEPDWN2                */
#define _AGC_STEPDWN_STEPDWN2_MASK                  0x1C0UL                               /**< Bit mask for AGC_STEPDWN2                   */
#define _AGC_STEPDWN_STEPDWN2_DEFAULT               0x00000004UL                          /**< Mode DEFAULT for AGC_STEPDWN                */
#define AGC_STEPDWN_STEPDWN2_DEFAULT                (_AGC_STEPDWN_STEPDWN2_DEFAULT << 6)  /**< Shifted mode DEFAULT for AGC_STEPDWN        */
#define _AGC_STEPDWN_STEPDWN3_SHIFT                 9                                     /**< Shift value for AGC_STEPDWN3                */
#define _AGC_STEPDWN_STEPDWN3_MASK                  0xE00UL                               /**< Bit mask for AGC_STEPDWN3                   */
#define _AGC_STEPDWN_STEPDWN3_DEFAULT               0x00000006UL                          /**< Mode DEFAULT for AGC_STEPDWN                */
#define AGC_STEPDWN_STEPDWN3_DEFAULT                (_AGC_STEPDWN_STEPDWN3_DEFAULT << 9)  /**< Shifted mode DEFAULT for AGC_STEPDWN        */
#define _AGC_STEPDWN_STEPDWN4_SHIFT                 12                                    /**< Shift value for AGC_STEPDWN4                */
#define _AGC_STEPDWN_STEPDWN4_MASK                  0x7000UL                              /**< Bit mask for AGC_STEPDWN4                   */
#define _AGC_STEPDWN_STEPDWN4_DEFAULT               0x00000006UL                          /**< Mode DEFAULT for AGC_STEPDWN                */
#define AGC_STEPDWN_STEPDWN4_DEFAULT                (_AGC_STEPDWN_STEPDWN4_DEFAULT << 12) /**< Shifted mode DEFAULT for AGC_STEPDWN        */
#define _AGC_STEPDWN_STEPDWN5_SHIFT                 15                                    /**< Shift value for AGC_STEPDWN5                */
#define _AGC_STEPDWN_STEPDWN5_MASK                  0x38000UL                             /**< Bit mask for AGC_STEPDWN5                   */
#define _AGC_STEPDWN_STEPDWN5_DEFAULT               0x00000006UL                          /**< Mode DEFAULT for AGC_STEPDWN                */
#define AGC_STEPDWN_STEPDWN5_DEFAULT                (_AGC_STEPDWN_STEPDWN5_DEFAULT << 15) /**< Shifted mode DEFAULT for AGC_STEPDWN        */

/* Bit fields for AGC GAINSTEPLIM */
#define _AGC_GAINSTEPLIM_RESETVALUE                 0x22003144UL                                  /**< Default value for AGC_GAINSTEPLIM           */
#define _AGC_GAINSTEPLIM_MASK                       0x3FFFFFFFUL                                  /**< Mask for AGC_GAINSTEPLIM                    */
#define _AGC_GAINSTEPLIM_CFLOOPSTEPMAX_SHIFT        0                                             /**< Shift value for AGC_CFLOOPSTEPMAX           */
#define _AGC_GAINSTEPLIM_CFLOOPSTEPMAX_MASK         0x1FUL                                        /**< Bit mask for AGC_CFLOOPSTEPMAX              */
#define _AGC_GAINSTEPLIM_CFLOOPSTEPMAX_DEFAULT      0x00000004UL                                  /**< Mode DEFAULT for AGC_GAINSTEPLIM            */
#define AGC_GAINSTEPLIM_CFLOOPSTEPMAX_DEFAULT       (_AGC_GAINSTEPLIM_CFLOOPSTEPMAX_DEFAULT << 0) /**< Shifted mode DEFAULT for AGC_GAINSTEPLIM    */
#define _AGC_GAINSTEPLIM_CFLOOPDEL_SHIFT            5                                             /**< Shift value for AGC_CFLOOPDEL               */
#define _AGC_GAINSTEPLIM_CFLOOPDEL_MASK             0xFE0UL                                       /**< Bit mask for AGC_CFLOOPDEL                  */
#define _AGC_GAINSTEPLIM_CFLOOPDEL_DEFAULT          0x0000000AUL                                  /**< Mode DEFAULT for AGC_GAINSTEPLIM            */
#define AGC_GAINSTEPLIM_CFLOOPDEL_DEFAULT           (_AGC_GAINSTEPLIM_CFLOOPDEL_DEFAULT << 5)     /**< Shifted mode DEFAULT for AGC_GAINSTEPLIM    */
#define _AGC_GAINSTEPLIM_HYST_SHIFT                 12                                            /**< Shift value for AGC_HYST                    */
#define _AGC_GAINSTEPLIM_HYST_MASK                  0xF000UL                                      /**< Bit mask for AGC_HYST                       */
#define _AGC_GAINSTEPLIM_HYST_DEFAULT               0x00000003UL                                  /**< Mode DEFAULT for AGC_GAINSTEPLIM            */
#define AGC_GAINSTEPLIM_HYST_DEFAULT                (_AGC_GAINSTEPLIM_HYST_DEFAULT << 12)         /**< Shifted mode DEFAULT for AGC_GAINSTEPLIM    */
#define _AGC_GAINSTEPLIM_MAXPWRVAR_SHIFT            16                                            /**< Shift value for AGC_MAXPWRVAR               */
#define _AGC_GAINSTEPLIM_MAXPWRVAR_MASK             0xFF0000UL                                    /**< Bit mask for AGC_MAXPWRVAR                  */
#define _AGC_GAINSTEPLIM_MAXPWRVAR_DEFAULT          0x00000000UL                                  /**< Mode DEFAULT for AGC_GAINSTEPLIM            */
#define AGC_GAINSTEPLIM_MAXPWRVAR_DEFAULT           (_AGC_GAINSTEPLIM_MAXPWRVAR_DEFAULT << 16)    /**< Shifted mode DEFAULT for AGC_GAINSTEPLIM    */
#define AGC_GAINSTEPLIM_TRANRSTAGC                  (0x1UL << 24)                                 /**< power transient detector Reset AGC          */
#define _AGC_GAINSTEPLIM_TRANRSTAGC_SHIFT           24                                            /**< Shift value for AGC_TRANRSTAGC              */
#define _AGC_GAINSTEPLIM_TRANRSTAGC_MASK            0x1000000UL                                   /**< Bit mask for AGC_TRANRSTAGC                 */
#define _AGC_GAINSTEPLIM_TRANRSTAGC_DEFAULT         0x00000000UL                                  /**< Mode DEFAULT for AGC_GAINSTEPLIM            */
#define AGC_GAINSTEPLIM_TRANRSTAGC_DEFAULT          (_AGC_GAINSTEPLIM_TRANRSTAGC_DEFAULT << 24)   /**< Shifted mode DEFAULT for AGC_GAINSTEPLIM    */
#define _AGC_GAINSTEPLIM_PNINDEXMAX_SHIFT           25                                            /**< Shift value for AGC_PNINDEXMAX              */
#define _AGC_GAINSTEPLIM_PNINDEXMAX_MASK            0x3E000000UL                                  /**< Bit mask for AGC_PNINDEXMAX                 */
#define _AGC_GAINSTEPLIM_PNINDEXMAX_DEFAULT         0x00000011UL                                  /**< Mode DEFAULT for AGC_GAINSTEPLIM            */
#define AGC_GAINSTEPLIM_PNINDEXMAX_DEFAULT          (_AGC_GAINSTEPLIM_PNINDEXMAX_DEFAULT << 25)   /**< Shifted mode DEFAULT for AGC_GAINSTEPLIM    */

/* Bit fields for AGC PNRFATT0 */
#define _AGC_PNRFATT0_RESETVALUE                    0x07142040UL                               /**< Default value for AGC_PNRFATT0              */
#define _AGC_PNRFATT0_MASK                          0x3FFFFFFFUL                               /**< Mask for AGC_PNRFATT0                       */
#define _AGC_PNRFATT0_LNAMIXRFATT1_SHIFT            0                                          /**< Shift value for AGC_LNAMIXRFATT1            */
#define _AGC_PNRFATT0_LNAMIXRFATT1_MASK             0x3FUL                                     /**< Bit mask for AGC_LNAMIXRFATT1               */
#define _AGC_PNRFATT0_LNAMIXRFATT1_DEFAULT          0x00000000UL                               /**< Mode DEFAULT for AGC_PNRFATT0               */
#define AGC_PNRFATT0_LNAMIXRFATT1_DEFAULT           (_AGC_PNRFATT0_LNAMIXRFATT1_DEFAULT << 0)  /**< Shifted mode DEFAULT for AGC_PNRFATT0       */
#define _AGC_PNRFATT0_LNAMIXRFATT2_SHIFT            6                                          /**< Shift value for AGC_LNAMIXRFATT2            */
#define _AGC_PNRFATT0_LNAMIXRFATT2_MASK             0xFC0UL                                    /**< Bit mask for AGC_LNAMIXRFATT2               */
#define _AGC_PNRFATT0_LNAMIXRFATT2_DEFAULT          0x00000001UL                               /**< Mode DEFAULT for AGC_PNRFATT0               */
#define AGC_PNRFATT0_LNAMIXRFATT2_DEFAULT           (_AGC_PNRFATT0_LNAMIXRFATT2_DEFAULT << 6)  /**< Shifted mode DEFAULT for AGC_PNRFATT0       */
#define _AGC_PNRFATT0_LNAMIXRFATT3_SHIFT            12                                         /**< Shift value for AGC_LNAMIXRFATT3            */
#define _AGC_PNRFATT0_LNAMIXRFATT3_MASK             0x3F000UL                                  /**< Bit mask for AGC_LNAMIXRFATT3               */
#define _AGC_PNRFATT0_LNAMIXRFATT3_DEFAULT          0x00000002UL                               /**< Mode DEFAULT for AGC_PNRFATT0               */
#define AGC_PNRFATT0_LNAMIXRFATT3_DEFAULT           (_AGC_PNRFATT0_LNAMIXRFATT3_DEFAULT << 12) /**< Shifted mode DEFAULT for AGC_PNRFATT0       */
#define _AGC_PNRFATT0_LNAMIXRFATT4_SHIFT            18                                         /**< Shift value for AGC_LNAMIXRFATT4            */
#define _AGC_PNRFATT0_LNAMIXRFATT4_MASK             0xFC0000UL                                 /**< Bit mask for AGC_LNAMIXRFATT4               */
#define _AGC_PNRFATT0_LNAMIXRFATT4_DEFAULT          0x00000005UL                               /**< Mode DEFAULT for AGC_PNRFATT0               */
#define AGC_PNRFATT0_LNAMIXRFATT4_DEFAULT           (_AGC_PNRFATT0_LNAMIXRFATT4_DEFAULT << 18) /**< Shifted mode DEFAULT for AGC_PNRFATT0       */
#define _AGC_PNRFATT0_LNAMIXRFATT5_SHIFT            24                                         /**< Shift value for AGC_LNAMIXRFATT5            */
#define _AGC_PNRFATT0_LNAMIXRFATT5_MASK             0x3F000000UL                               /**< Bit mask for AGC_LNAMIXRFATT5               */
#define _AGC_PNRFATT0_LNAMIXRFATT5_DEFAULT          0x00000007UL                               /**< Mode DEFAULT for AGC_PNRFATT0               */
#define AGC_PNRFATT0_LNAMIXRFATT5_DEFAULT           (_AGC_PNRFATT0_LNAMIXRFATT5_DEFAULT << 24) /**< Shifted mode DEFAULT for AGC_PNRFATT0       */

